<?php
/*
* Main Theme Files
*
* @package Cleana
*/
// Exclude category with ID 12 (replace with your category ID)
$category_id = get_cat_ID(CLEANA_NO_CATEGORY);
$query = new WP_Query( array( 'category__not_in' => array( $category_id ) ) );
$blog_id = get_cat_ID(CLEANA_BOLG_ID);
$blog = new WP_Query( array( 'category__in' => array( $blog_id ) ) );
$home_page_image = get_option('theme_options');
print_r( $home_page_image );
echo $home_page_image['section1_title'];
$args=[
	[
	  "title"=> "خدمة تنظيف المنازل و الشقق , الفلل , القصور , المساجد , الشركات و المؤسسات",
	  "paragraph"=> "خدمة تنظيف منازل تتميز منصتنا بتقديم خدمات جديدة وحصرية في تنظيف المنازل ، وتعقيم المنزل او الفلل او الشقق الشركة توفر عليك جهوداً كبيرة في تنظيف المنازل كل ما عليك فقط هو الاتصال وطلب خدماتنا ، شركتنا تقدم ايضاً عروض وخصومات بمناسبة العام الجديد مما جعلها ارخص بشهادة جميع السادة العملاء .",
	  "image"=> "gdfgdfg",
	],
	[
	  "title"=> "خدمة مكافحة الحشرات , الصراصير , الفئران , النمل الابيض , الحمام و بق الفراش ",
	  "paragraph"=> "مع دخول فصل الصيف يأتي ومعه كميات هائلة من الحشرات والميكروبات والفيروسات التي تؤرق ربة المنزل وتستهلك كميات هائلة من صحتها وجهدها ووقتها للتعامل مع هذة الحشرات .
	  من الآن لا داعي للقلق تستطيع شركة مكافحة حشرات الخاصة بنا في جميع انحاء المملكة  التعامل مع كل ما يعكر صفوة حياتك عزيزي العميل ويستهلك جزء من راحتك ، هدف شركة مكافحة حشرات الاول والاخير هو راحتك وسعادتك أنت واسرتك ، معنا لا داعي للقلق نهائياً.",
	  "image"=> "gdfgdfg",
	],
];
$args2=[
	[
	  "title"=> "خدمة تنظيف الخزانات وغسيل الخزانات , وصيانة جميع انواع الخزانات",
	  "paragraph"=> "تعد خدمة تنظيف الخزانات وغسيل الخزانات من الخدمات المهمة التي يجب الاهتمام بها بشكل دوري، وذلك لضمان نظافة المياه وخلوها من الملوثات البكتيرية والفطرية التي يمكن أن تسبب العديد من المشاكل الصحية.
	  تختلف خطوات تنظيف الخزانات حسب نوع الخزان، فهناك خزانات أرضية وخزانات علوية وخزانات خرسانية وخزانات معدنية. كما تختلف مدة تنظيف الخزانات حسب حجم الخزان ودرجة التلوث الموجودة به.
	  وتوفر العديد من الشركات المتخصصة في مجال التنظيف خدمة تنظيف الخزانات وغسيل الخزانات، وذلك باستخدام أحدث المعدات والمواد المناسبة لتنظيف جميع أنواع الخزانات.
	  ",
	  "image"=> "gdfgdfg",
	],
	[
	 "title"=> "خدمة تسليك المجاري وتنظيف المجاري",
	 "paragraph"=> "تتضمن خدمة تنظيف المجاري وتنظيف المجاري عدة خطوات أساسية:

	 كشف مكان الانسداد: يتم استخدام أحدث الأجهزة والأدوات لكشف مكان الانسداد في المجاري باستخدام جهاز الكاميرا أو جهاز الأشعة السينية.
	 إزالة الانسداد: تتم إزالة الانسداد باستخدام طرق متنوعة، مثل استخدام الكابلات، أو الضغط العالي، أو المواد الكيميائية.
	 تنظيف المجاري: يتم تنظيف المجاري باستخدام مواد تنظيف خاصة، وذلك لإزالة كافة الأوساخ والرواسب التي تتراكم في المجاري.
	 تختلف خطوات تنظيف المصارف وتنظيفها حسب نوع الانسداد. هناك انسدادات بسيطة يمكن حلها باستخدام الكابلات أو الضغط العالي، وهناك انسدادات أكثر تعقيدًا قد تتطلب استخدام مواد كيميائية أو أدوات متخصصة.
	 تقدم العديد من الشركات المتخصصة في مجال التنظيف خدمات تنظيف المجاري وتنظيف المجاري باستخدام أحدث المعدات والمواد المناسبة لإزالة جميع أنواع الانسدادات في المجاري.",
	 "image"=> "gdfgdfg",
	],
];
$args3=[
	[
		"title"=> "خدمة نقل العفش و الاثاث , تخزين وتغليف العفش والاثاث , وبيع وشراء الاثاث المستعمل",
		"paragraph"=> "تعد خدمة نقل العفش و الأثاث من الخدمات المهمة التي يحتاجها العديد من الأشخاص، وذلك عند الانتقال من منزل إلى آخر أو عند شراء أثاث جديد.
		تختلف تكلفة خدمة نقل العفش و الأثاث حسب حجم ونوع الأثاث وعدد العمالة اللازمة لنقله والمسافة بين المكانين.
		وتوفر العديد من الشركات المتخصصة في مجال نقل الأثاث خدمة نقل العفش و الأثاث، وذلك باستخدام أحدث المعدات والمواد المناسبة لنقل جميع أنواع الأثاث.
		خدمة تخزين وتغليف العفش والاثاث
		تعد خدمة تخزين وتغليف العفش والاثاث من الخدمات المهمة التي يحتاجها العديد من الأشخاص، وذلك عند السفر أو عند تجديد المنزل أو عند نقل الأثاث إلى مكان آخر.
		تختلف تكلفة خدمة تخزين وتغليف العفش والاثاث حسب حجم ونوع الأثاث ومدة التخزين.
		وتوفر العديد من الشركات المتخصصة في مجال تخزين الأثاث خدمة تخزين وتغليف العفش والاثاث، وذلك باستخدام أحدث المعدات والمواد المناسبة لتخزين جميع أنواع الأثاث.
		",
	  "image"=> "gdfgdfg",
	],
	[
		"title"=> "خدمة تنظيف الكنب و السجاد و الموكيت بأحدث الطرق والاساليب",
		"paragraph"=> "تعد خدمة تنظيف الكنب و السجاد و الموكيت من الخدمات المهمة التي يجب الاهتمام بها بشكل دوري، وذلك للحفاظ على نظافتها وخلوها من الأوساخ والبقع التي يمكن أن تسبب العديد من المشاكل الصحية.
		تختلف طرق تنظيف الكنب و السجاد و الموكيت حسب نوع القماش أو الخامة المصنوع منها، فهناك أنواع من الكنب و السجاد و الموكيت يمكن تنظيفها بالماء والصابون، وهناك أنواع أخرى يجب تنظيفها بالمكنسة الكهربائية أو باستخدام مواد التنظيف الجافة.
		وتوفر العديد من الشركات المتخصصة في مجال التنظيف خدمة تنظيف الكنب و السجاد و الموكيت، وذلك باستخدام أحدث المعدات والمواد المناسبة لتنظيف جميع أنواع الكنب و السجاد و الموكيت.
		طرق تنظيف الكنب
		تختلف طرق تنظيف الكنب حسب نوع القماش المصنوع منه، فهناك أنواع من الكنب يمكن تنظيفها بالماء والصابون، وهناك أنواع أخرى يجب تنظيفها بالمكنسة الكهربائية أو باستخدام مواد التنظيف الجافة.
		تنظيف الكنب المصنوع من الجلد
		يمكن تنظيف السجاد والموكيت بالمكنسة الكهربائية أو باستخدام مواد التنظيف الجافة أو باستخدام البخار.
		يتم تنظيف السجاد والموكيت بالمكنسة الكهربائية لإزالة الغبار والأوساخ والأتربة العالقة به.
		تنظيف السجاد والموكيت بمواد التنظيف الجافة
		تنظيف السجاد والموكيت بالبخار
		يعتبر تنظيف السجاد والموكيت بالبخار من أفضل الطرق، وذلك لأنه يساعد على إزالة الأوساخ والبقع العميقة العالقة بالسجاد والموكيت.
		",
	  "image"=> "gdfgdfg",
	],
]
?>
<?php get_header();?>
<!--Start Main Section-->
<main>
<?php
get_template_part( 'template-parts/components/posts-carousel' );
get_template_part( 'template-parts/components/cateories' );
if ( have_posts() ) :
	?>
	<!--Start Section Services-->
	<?php
	if ( $query->have_posts() ){
	?>
	<section class=" mx-auto p-5 sm:p-10 md:p-16 bg-blue-50 dark:bg-slate-800">
		<?php
		if ( is_home() && ! is_front_page() ) {
		?>
		<section class="mx-auto max-w-lg text-center py-2">
			<h1 class="page-title text-2xl font-semibold text-gray-800 capitalize lg:text-3xl dark:text-white">
				<?php echo get_bloginfo('name') ?> : خدماتنا
			</h1>
			<p class="mt-4 dark:text-gray-300 dark:text-gray-400">
				<strong>
				نقدم خدمات منزلية (شركات تنظيف منازل - شركات تنظيف كنب وسجاد وموكيت -شركات تنظيف خزانات - وشركات مكافحة الحشرات والفئران والبق والصراصير - شركات نقل العفش والاثات -شركات شراء الاثاث المستعمل ) 
				</strong>
			</p>
		</section>
		<?php
		}
		?>
		<section class="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-10">
		<?php
		if ( $query->have_posts() ) :
			while ( $query->have_posts() ) : $query->the_post();
				get_template_part( 'template-parts/content/content-blog' );
			endwhile;
		  endif;
		  wp_reset_postdata();
		?>
		</section>
	</section>
	<?php
	}
	?>
	<!--End Section Services-->
	
	<!--Start Section Blog-->
	<?php
	if ( $blog->have_posts() ){
	?>
	<section class=" mx-auto p-5 sm:p-10 md:p-16 bg-blue-200 dark:bg-gray-900">
		<?php
		if ( is_home() && ! is_front_page() ) {
		?>
		<section class="mx-auto max-w-lg text-center py-2">
			<h2 class="page-title text-2xl font-semibold text-gray-800 capitalize lg:text-3xl dark:text-white">
				المدونة
			</h2>
			<p class="mt-4 dark:text-gray-300 dark:text-gray-400">
			تقدم المدونة المقالات التي قد تفيدك وتساعدك في حلول سريعة ورائعة في منزلك وهذه الموضوعات حول (مكافحة الحشرات والصرارصير - وطرق تنظيف المنازل والكنب والسجاد - تنظيف وغسيل الخزانات المياة - وتسليك مجاري المطبخ - وطرق تخزين الاثاث - الخ....)
			</p>
		</section>
		<?php
		}
		?>
		<section class="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-10">
		<?php		
		if ( $blog->have_posts() ) :
			while ( $blog->have_posts() ) : $blog->the_post();
				get_template_part( 'template-parts/content/content-blog' );
			endwhile;
		  endif;
		  wp_reset_postdata();
		?>
		</section>
	</section>
	<?php
	}
	?>
	<!--End Section Blog-->
	<?php get_template_part( 'template-parts/components/hero-section',"",$args)?>
	<?php get_template_part( 'template-parts/components/hero-section',"",$args2)?>
	<?php get_template_part( 'template-parts/components/hero-section',"",$args3)?>
	<?php get_template_part( 'template-parts/components/trending')?>
<?php 
else :
	get_template_part( 'template-parts/content/content-none' );
endif;
?>
</main>
<!--End MAin Section-->
<?php get_footer()?>